
## Plan Result (sandbox/amplify)

[CI link](https://github.com/tqer39/time-capsule/actions/runs/8677407807)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.amplify.aws_amplify_app.this
  * module.amplify.aws_amplify_branch.this
  * module.amplify.aws_amplify_domain_association.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.amplify.aws_amplify_app.this will be created
  + resource "aws_amplify_app" "this" {
      + arn               = (known after apply)
      + build_spec        = (known after apply)
      + custom_headers    = (known after apply)
      + default_domain    = (known after apply)
      + id                = (known after apply)
      + name              = "time-capsule-dev"
      + platform          = "WEB"
      + production_branch = (known after apply)
      + tags_all          = {
          + "tc:environment" = "sandbox"
          + "tc:iac"         = "terraform"
          + "tc:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "tc:product"     = "time-capsule"
          + "tc:repository"  = "tqer39/time-capsule"
          + "tc:source_path" = "./infrastructure/environments/sandbox/time_capsule"
        }
    }

  # module.amplify.aws_amplify_branch.this will be created
  + resource "aws_amplify_branch" "this" {
      + app_id               = (known after apply)
      + arn                  = (known after apply)
      + associated_resources = (known after apply)
      + branch_name          = "main"
      + custom_domains       = (known after apply)
      + destination_branch   = (known after apply)
      + display_name         = (known after apply)
      + enable_auto_build    = true
      + id                   = (known after apply)
      + source_branch        = (known after apply)
      + tags_all             = {
          + "tc:environment" = "sandbox"
          + "tc:iac"         = "terraform"
          + "tc:owner"       = "tqer39+aws-sandbox@gmail.com"
          + "tc:product"     = "time-capsule"
          + "tc:repository"  = "tqer39/time-capsule"
          + "tc:source_path" = "./infrastructure/environments/sandbox/time_capsule"
        }
    }

  # module.amplify.aws_amplify_domain_association.this will be created
  + resource "aws_amplify_domain_association" "this" {
      + app_id                              = (known after apply)
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "time-capsule.tqer39.com"
      + enable_auto_sub_domain              = false
      + id                                  = (known after apply)
      + wait_for_verification               = true

      + sub_domain {
          + branch_name = "main"
          + dns_record  = (known after apply)
          + prefix      = "dev"
          + verified    = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":19,"Program":"tfcmt","SHA1":"cd1f9c89eafd6bf3b082dc3a150790cc1912cef1","Target":"sandbox/amplify","Vars":{},"WorkflowName":"infrastucture - sandbox"} -->